jobs/20260802-164316-luqia-vllm-kv-scheduler-autoscale-power-r3/kv_scheduler_autoscale_power_results/bench_3_decode_scale_to_3.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72c99267d1b0>, seed=0, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30365', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=128, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=16.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-32554ba7-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 08-02 16:50:45 [datasets.py:612] Sampling input_len from [31, 31] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:01<00:00,  1.95s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 160/160 [00:12<00:00, 13.03it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             128       
Request rate configured (RPS):           16.00     
Benchmark duration (s):                  12.28     
Total input tokens:                      4960      
Total generated tokens:                  5120      
Request throughput (req/s):              13.03     
Output token throughput (tok/s):         417.08    
Peak output token throughput (tok/s):    651.00    
Peak concurrent requests:                66.00     
Total token throughput (tok/s):          821.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          414.29    
Median TTFT (ms):                        378.36    
P99 TTFT (ms):                           930.91    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          64.86     
Median TPOT (ms):                        65.20     
P99 TPOT (ms):                           66.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           64.86     
Median ITL (ms):                         64.67     
P99 ITL (ms):                            78.35     
==================================================